{
  "إنشاء دالة": {
    "prefix": "دالة",
    "body": ["دالة ${1:اسم_الدالة}():"],
    "description": "إنشاء دالة جديدة حيث يمكنك تعريف اسم الدالة والمعاملات التي تحتاجها. تُستخدم الدالة لتنفيذ مجموعة من التعليمات بشكل متكرر بناءً على المعاملات التي تم تمريرها."
  },
  "اطبع شئ": {
    "prefix": "اطبع",
    "body": ["اطبع(${1:\"السلام عليكم يا عالم\"})"],
    "description": "استخدام أمر الطباعة لعرض نص أو قيمة متغير أو رقم أو أي نوع آخر من البيانات على الشاشة. يمكن أن يساعد في عرض نتائج العمليات أو التحقق من القيم أثناء البرمجة."
  },
  "ادخل شئ": {
    "prefix": "ادخل",
    "body": ["ادخل(${1:\"قم بإدخال نص:\"})"],
    "description": "استخدام أمر الإدخال لطلب قيمة من المستخدم. يمكن أن يكون نصًا أو رقمًا ويُستخدم لقراءة مدخلات المستخدم في البرنامج."
  },
  "حاله شرطية": {
    "prefix": "اذا",
    "body": ["اذا ${1:الشرط}:"],
    "description": "إنشاء جملة شرطية لاختبار شرط معين. إذا تحقق الشرط، سيتم تنفيذ الشفرة الموجود داخل الجملة الشرطية. إذا لم يتحقق، يتم تجاهل الشفرة داخلها."
  },
  "حاله شرطية اخري": {
    "prefix": "اواذا",
    "body": ["اواذا ${1:الشرط}:"],
    "description": "إنشاء جملة شرطية لاختبار شرط معين بعد الشرط الأول. إذا تحقق الشرط، سيتم تنفيذ الشفرة الموجود داخل الجملة الشرطية. إذا لم يتحقق، يتم تجاهل الشفرة داخلها."
  },
  "والا": {
    "prefix": "والا",
    "body": ["والا ${1:الشرط}:"],
    "description": "إنشاء جملة شرطية لتنفيذ شفرة معين إذا لم يتحقق الشرط السابق. يمكن استخدامها لتنفيذ شفرة معين إذا لم يتحقق الشرط السابق."
  },
  "صح": {
    "prefix": "صح",
    "body": ["صح"],
    "description": "يمثل القيمة الصحيحة في البرمجة. يُستخدم للإشارة إلى حالة تكون صحيحة أو شرط يتحقق."
  },
  "خطأ": {
    "prefix": "خطأ",
    "body": ["خطأ"],
    "description": "يمثل القيمة غير الصحيحة في البرمجة. يُستخدم للإشارة إلى حالة تكون خاطئة أو شرط لا يتحقق."
  },
  "ثابت": {
    "prefix": "ثابت",
    "body": ["ثابت"],
    "description": "يستخدم لتعريف القيم التي لا يمكن تغييرها بعد تعيينها. القيمة تبقى ثابتة طوال فترة تنفيذ البرنامج."
  },
  "توقف": {
    "prefix": "توقف",
    "body": ["توقف"],
    "description": "إيقاف تنفيذ البرنامج في نقطة معينة. يمكن استخدامها لإيقاف تنفيذ البرنامج بشكل مؤقت أثناء التطوير للتحقق من القيم أو النتائج."
  },
  "استمر": {
    "prefix": "استمر",
    "body": ["استمر"],
    "description": "تُستخدم لتخطي التكرار الحالي في الحلقات والتوجه للتكرار التالي."
  },
  "ليس": {
    "prefix": "ليس",
    "body": ["ليس"],
    "description": "تُستخدم لعكس قيمة الشرط، بمعنى أن الشروط السلبية تتحقق إذا كانت القيم غير متساوية أو غير صحيحة."
  },
  "احذف": {
    "prefix": "احذف",
    "body": ["احذف ${1:اسم_المتغير}"],
    "description": "حذف متغير معين من الذاكرة. يمكن استخدامها لتحرير الذاكرة بعد الانتهاء من استخدام المتغير."
  },
  "استورد": {
    "prefix": "استورد",
    "body": ["استورد ${1:اسم_المكتبة}"],
    "description": "استيراد مكتبة أو ملف خارجي لاستخدامه في البرنامج. يمكن استخدامها لتوسيع قدرات البرنامج أو إضافة وظائف جديدة."
  },
  "تحويل لعدد صحيح": {
    "prefix": "صحيح",
    "body": ["صحيح(${1:القيمة})"],
    "description": "تحويل قيمة معينة إلى عدد صحيح. يمكن استخدامها لتحويل القيم العشرية إلى أعداد صحيحة."
  },
  "تحويل لعدد عشري": {
    "prefix": "عشري",
    "body": ["عشري(${1:القيمة})"],
    "description": "تحويل قيمة معينة إلى عدد عشري. يمكن استخدامها لتحويل القيم الصحيحة إلى أعداد عشرية."
  },
  "اضف شئ من مصفوفة": {
    "prefix": ".اضف",
    "body": [".اضف(${1:القيمة})"],
    "description": "إضافة عنصر جديد إلى مصفوفة. يمكن استخدامها لإضافة عنصر جديد إلى مصفوفة بناءً على موقعه."
  },
  "مسح شئ من مصفوفة": {
    "prefix": ".امسح",
    "body": [".امسح(${1:القيمة})"],
    "description": "حذف عنصر معين من مصفوفة. يمكن استخدامها لحذف عنصر معين من مصفوفة بناءً على موقعه."
  },
  "ادرج شئ من مصفوفة": {
    "prefix": ".ادرج",
    "body": [".ادرج(${1:القيمة})"],
    "description": "إدراج عنصر جديد في مصفوفة. يمكن استخدامها لإدراج عنصر جديد في مصفوفة بناءً على موقعه."
  },
  "حلقة تكرار لاجل": {
    "prefix": "لاجل",
    "body": ["لاجل ${1:المتغير} في مدى(${2:العدد}):"],
    "description": "إنشاء حلقة تكرار تعتمد على عدد معين من المرات. تستخدم لتكرار تنفيذ جزء من الشفرة عدة مرات بناءً على قيم معينة مثل عدد المرات أو عناصر في مجموعة معينة."
  },
  "حلقة تكرار بينما": {
    "prefix": "بينما",
    "body": ["بينما ${1:الشرط}:"],
    "description": "إنشاء حلقة تكرار تعمل طالما كان الشرط المحدد صحيحًا. تُستخدم عندما ترغب في تكرار الشفرة بناءً على شرط معين دون معرفة مسبقة بعدد التكرارات."
  },
  "مدى": {
    "prefix": "مدى",
    "body": ["مدى(${1:البداية}, ${2:النهاية})"],
    "description": "إنشاء مدى من الأرقام بين قيمتين معينتين. يمكن استخدامها لإنشاء مدى من الأرقام بين قيمتين معينتين لاستخدامها في حلقات التكرار."
  },
  "صنف": {
    "prefix": "صنف",
    "body": ["صنف ${1:اسم_الصنف}:"],
    "description": "يُستخدم لإنشاء كائنات وفق تصاميم محددة (البرمجة الكائنية)."
  }
}
